/* 
  Common.strings
  Secrets

  Created by Paulo Andrade on 29/11/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/

"Passphrase" = "Contraseña";
"ConfirmPassphrase" = "Confirmar contraseña";
"EnterPassphrase" = "Introduce tu contraseña";


// password strength
"PasswordScore.VeryWeak" = "muy débil";
"PasswordScore.Weak" = "débil";
"PasswordScore.OK" = "normal";
"PasswordScore.Good" = "buena";
"PasswordScore.Excellent" = "excelente";


// Button titles
"Button.Show" = "Mostrar";
"Button.Hide" = "Ocultar";
"Button.Copy" = "Copiar";
"Button.Reveal" = "Mostrar";
"Button.Conceal" = "Ocultar";
"Button.Recover" = "Recuperar";
"Button.Trash" = "Papelera";
"Button.MoveToTrash" = "Mover a la papelera";
"Button.Cancel" = "Cancelar";
"Button.OK" = "ACEPTAR";
"Button.Done" = "Terminado";
"Button.Continue" = "Continuar";
"Button.Close" = "Cerrar";
"Button.Edit" = "Editar";
"Button.Back" = "Volver";
"Button.Fill" = "Rellenar";
"Button.Send" = "Enviar";
"Button.FillOptions" = "Completar...";
"Button.AssociateAndFill" = "Asociar y completar";
"Button.Delete" = "Borrar";
"Button.Add" = "Añadir";
"Button.Restore" = "Restablecer";
"Button.Sync" = "Sincronizar";
"Button.NotNow" = "Ahora no";
"Button.Update" = "Actualizar";
"Button.ChangePassphrase" = "Cambiar contraseña";
"Button.Change" = "Cambiar";
"Button.DeleteiCloudData" = "Borrar datos de iCloud";
"Button.YesSure" = "Sí, estoy seguro";
"Button.YesDelete" = "Sí, borrar";
"Button.Reset" = "Restablecer";
"Button.Unlock" = "Desbloquear ";
"Button.Enable" = "Activar";
"Button.Disable" = "Desactivar";
"Button.Dismiss" = "Descartar";
"Button.Refresh" = "Actualizar";
"Button.Upgrade" = "Mejorar";

// Filters
"Filter.All" = "Todo";
"Filter.AllItems" = "Todos los objetos";
"Filter.Trash" = "Papelera";


/* Copy item action */
"Action.CopyItem" = "Copiar %@";
"Action.CopyItem2Lines" = "Copiar\n%@";
"Action.RevealItem" = "Mostrar %@";
"Action.ConcealItem" = "Ocultar %@";
"Action.RecoverItem" = "Recuperar %@";
"Action.FillItem" = "Completar %@";
"Action.SendItem" = "Enviar %@ a aplicación solicitante";
"Action.MoveItemToTrash" = "Mover %@ a la papelera";
"Action.DeleteItem" = "Borrar %@";

/* Option presented when nothing is found for a given search string. Eg: Add Login for "twitter" */
"Search.AddItem" = "Añadir %@ para \"%@\"";
/* Presented when nothing is found for a given search string. Eg: No logins found */
"Search.NoResultsTitle" = "No se encuentra %@";
/* Presented when nothing is found for a given search string. Eg: Couldn't find any logins matching you search. */
"Search.NoResultsDetailed" = "No se ha encontrado ningún %@ que coincida con la búsqueda.";
/* Trash is empty title */
"Search.TrashEmptyTitle" = "No hay objetos en la papelera";
/* Trash is empty message */
"Search.TrashEmptyMessage" = "Parece que no has enviado ningún secreto a la papelera.";
/* Empty section title */
"Search.SectionEmptyTitle" = "No hay %@ para mostrar";
/* Empty section message */
"Search.SectionEmptyMessage" = "Añade un %@ pulsando el botón + arriba.";
/* Empty section message touch */
"Search.SectionEmptyMessageTouch" = "Añade un %@ pulsando el botón + abajo.";


// iCloud & Sync
"iCloud.CredentialItemName" = "contraseña de sincronización con iCloud %@";
"iCloud.CredentialNoteContent" = "Esta entrada se generó automáticamente al configurar iCloud. Se usa a nivel interno para sincronizar con iCloud.\n Puedes cambiar su nombre o nombre de usuario, pero deja la contraseña y el servicio iCloud asociado intacto. Gracias :)";
/* Merge notice */
"Sync.AutomaticallyMergedNotice" = "Se ha fusionado automáticamente debido a un conflicto en %@";
/* Presented on a small overlay when the app is syncing */
"Sync.Syncing" = "Sincronizando";
/* Presented when iCloud sync is uploading the file data */
"Sync.WaitingForUpload" = "Esperando a que la subida finalice...";
/* Last sync date */
"Sync.LastSynced" = "Última sincronización: %@";
/* Title for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Title" = "Tu contraseña no se sincroniza automáticamente a través de iCloud.";
/* Message for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Message" = "Debes actualizar la contraseña manualmente en tus otros dispositivos para seguir usando iCloud Sync.";

/* Asked during setup when iCloud data already exists */
"iCloud.ShouldRestore" = "¿Quieres restablecer tus datos desde iCloud?";
/* Asked during setup when creating a new iCloud store */
"iCloud.ShouldSync" = "¿Quieres volver a sincronizar con iCloud?";

"iCloud.SetupFailedAlert.Title" = "No se ha podido habilitar iCloud Sync.";
"iCloud.SetupFailedAlert.Message" = "Intenta habilitarlo de nuevo más tarde.";
"iCloud.SetupFailedAlert.MessageTouch" = "Intenta habilitarlo de nuevo más tarde en Ajustes.";

/* Presented during setup while checking for iCloud data */
"iCloud.CheckingiCloud" = "Comprobando iCloud...";

/* Alert title when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Title" = "iCloud no está disponible.";
/* Alert message when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Message" = "Asegúrate de que has iniciado sesión en iCloud y tienes habilitados \"Documentos y datos\" en las preferencias del sistema.";
"iCloud.NotAvailableAlert.MessageTouch" = "Asegúrate de que has iniciado sesión en iCloud.";

/* Disable iCloud confirmation dialog title */
"iCloud.DisableSyncAlert.Title" = "¿Seguro que quieres deshabilitar iCloud Sync?";
/* Disable iCloud confirmation dialog message */
"iCloud.DisableSyncAlert.Message" = "Si deshabilitas los datos realizados en este dispositivo, no se sincronizará con iCloud y viceversa.";

/* Delete iCloud confirmation dialog title */
"iCloud.DeleteDataAlert.Title" = "¿Seguro que quieres borrar tus datos de iCloud?";
/* Delete iCloud confirmation dialog message */
"iCloud.DeleteDataAlert.Message" = "Esto impedirá que cualquier otro dispositivo vinculado en este momento con tu cuenta de iCloud se sincronice. Tendrás que reconfigurar la sincronización de iCloud en todos ellos.";

/* Sync with iCloud setting */
"iCloud.SyncSetting" = "Sincronización con iCloud";
/* Sync with iCloud explanation */
"iCloud.Info" = "iCloud Sync te permite acceder a tus datos desde todos tus dispositivos.";
/* iCloud Sync footer explanation when iCloud store file is missing */
"iCloud.Status.Missing" = "No se encuentran datos de iCloud. Puede que los hayas borrado en otro dispositivo. Para volver a habilitar la sincronización con iCloud tendrás que deshabilitarlo y volver a habilitarlo.";
/* iCloud Sync footer explanation when iCloud is unavailable but enabled */
"iCloud.Status.EnabledButUnavailable" = "iCloud no está accesible en este momento. Puede que hayas cerrado sesión en iCloud o que hayas iniciado sesión con un usuario diferente.";
/* iCloud Sync footer explanation when iCloud is unavailable and disabled */
"iCloud.Status.DisabledAndUnavailable" = "iCloud no está accesible en este momento. Puede que hayas cerrado sesión en iCloud.";



/* Delete multiple item confirmation alert title */
"Alert.PermanentlyDelete.Title" = "Borrar permanentemente %d elementos.";
/* Delete multiple item confirmation alert message */
"Alert.PermanentlyDelete.Message" = "¿Seguro que quieres borrar permanentemente estos %d elementos?";

"Alert.PremiumRequired.Title" = "Se requiere la versión Premium";
"Alert.PremiumRequired.Message" = "Mejora a Premium para crear y sincronizar más de %d elementos.";

// Store
"Store.Version.Free" = "Gratis";
"Store.Version.Premium" = "Premium";

"Store.Button.Buy" = "Comprar %@";
"Store.Button.Restore" = "¿Ya comprado? Restablecer ≫";

"Store.PremiumUpgrade.Title" = "Mejora a Premium";
"Store.PremiumUpgrade.Message" = "Mejorar permite elementos ilimitados. Se trata de una compra única.";

"Store.ProcessingTransaction.Title" = "Procesando...";
"Store.ProcessingTransaction.Message" = "Esperando a que la transacción se complete.";

"Store.HasPremium.Title" = "Premium desbloqueado ?";
"Store.HasPremium.Message" = "Tienes la versión Premium de Secrets. ¡Gracias!";

"Store.WaitingOnTransaction.Title" = "Esperando autorización";
"Store.WaitingOnTransaction.Message" = "Tu compra está pendiente de aprobación del delegado de la familia.";

"Store.TransactionFailed.Title" = "Transacción ha fallado";
"Store.TransactionFailed.Message" = "Por favor vuelva a intentar su compra.";

"Store.OtherPlaformNotIncluded" = "La versión Premium para iOS se vende por separado.";

// New item
"NewItem.FreeVersionLimit" = "La versión gratuita tiene un límite de %d elementos.";
"NewItem.ItemsLeft" = "Puedes crear %d elementos más.";

/* Phrase for system's authentication prompt when unlocking secrets */
"DeviceAuthentication.AuthRequiredToUnlock" = "Autentique para desbloquear sus secretos";
"DeviceAuthentication.UnlockSecrets" = "Desbloquear sus secretos";
